#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСостав(Команда)

	КоличествоОбъектов = ЗаполнитьСоставНаСервере();
	ПоказатьОповещениеПользователя("Состав OData заполнен: " + КоличествоОбъектов + " объектов.");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьСоставНаСервере()

	МассивОбъектов = Новый Массив();

	Для Каждого МетаОбъект Из Метаданные.Справочники Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.Документы Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.Перечисления Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.РегистрыСведений Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.РегистрыНакопления Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.РегистрыРасчета Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.РегистрыБухгалтерии Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.ПланыВидовХарактеристик Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.ПланыВидовРасчета Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.ПланыСчетов Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;
	Для Каждого МетаОбъект Из Метаданные.Константы Цикл
		МассивОбъектов.Добавить(МетаОбъект);
	КонецЦикла;

	УстановитьСоставСтандартногоИнтерфейсаOData(МассивОбъектов);

	Возврат МассивОбъектов.Количество();

КонецФункции

#КонецОбласти
